Show / Hide Table of Contents
Class Point2D
Represents an x- and y-coordinate pair in two-dimensional space.
Inheritance
System.Object
OpenObject
Point2D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("System.Windows.Point, WindowsBase")]
[DataContract]
public class Point2D : OpenObject
Properties
Improve this Doc   View Source
X
Gets or sets the X-coordinate value
Declaration
[DataMember]
public double X { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Y
Gets or sets the Y-coordinate value
Declaration
[DataMember]
public double Y { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source